{
  "model_type": "time_moe",
  "input_size": 1,
  "hidden_size": 64,
  "intermediate_size": 256,
  "horizon_lengths": [
    1,
    8,
    32,
    64
  ],
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_key_value_heads": 4,
  "hidden_act": "silu",
  "num_experts_per_tok": 2,
  "num_experts": 4,
  "max_position_embeddings": 2048,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-06,
  "use_cache": true,
  "use_dense": false,
  "rope_theta": 10000,
  "attention_dropout": 0.0,
  "apply_aux_loss": true,
  "router_aux_loss_factor": 0.02,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.40.1"
}